# ws2GetMenusCnt

## Description
Workspace advanced APIs. Return the number of menu items at the speicfied path. Use '/' for path delimiter of universal menu names.

```pascal
FUNCTION ws2GetMenusCnt(menuPath : DYNARRAY[] of CHAR): INTEGER;
```

```python
def vs.ws2GetMenusCnt(menuPath):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|menuPath|DYNARRAY[] of CHAR|   |

## Version
Availability: from Vectorworks 2021

## Category
* Workspaces